Revit 2027 API
SymbolTypeId.KN Property
 Symbol kN, indicating unit Kilonewtons.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId KN { get; }
Public Shared ReadOnly Property KN As ForgeTypeId
	Get
public:
static property ForgeTypeId^ KN {
	ForgeTypeId^ get ();
}
static member KN : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SymbolTypeId Class
Autodesk.Revit.DB Namespace